# ==============================================================================
# mod01: 메인화면 출력 ex)"C:\python\test.txt"
# =============================================================================
import reader  # reader.py 모듈을 불러온다.

def mod01():
    while True:
        print("\n==========================================")
        print("텍스트 단어 인덱스 프로그램")
        print("읽어들일 텍스트 파일 경로를 입력하세요, 0을 입력시 종료")
        print("ex) C://....")
        print("==========================================") # 메인화면 출력

        입력 = input().strip().strip('"')  # 입력받을 때 양쪽의 따옴표(")가 들어가도 제거되도록 처리
        if 입력 == "0":
            print("프로그램을 종료한다.") # 첫 메인에서 0 입력시 종료
            break

        print(f"입력된 파일 경로: ( {입력} )이 맞는가? (y/n)") # 경로가 맞는지 재확인
        확인 = input()
        if 확인 == "y":
            print("파일 경로가 확인되었다. 프로그램을 진행한다.") #사용자가 확인하면 reader.py의 mod02 함수로 이동
            reader.mod02(입력) # 입력(주소)를 들고 간다.
        elif 확인 == "n":
            print("파일 경로를 다시 입력.") #사용자가 아니라고하면 다시 메인화면으로 돌아간다.
            continue

# ==============================================================================
# 프로그램 실행
# ==============================================================================
if __name__ == "__main__":
    mod01() #스타토