# ==============================================================================
# mod01: 메인화면 출력
# =============================================================================
import reader  # reader.py 모듈을 불러온다.

def mod01():
    while True:
        print("\n==========================================")
        print("텍스트 단어 인덱스 프로그램")
        print("읽어들일 텍스트 파일 경로를 입력하세요, 0을 입력시 종료")
        print("ex) C://....")
        print("==========================================")

        입력 = input().strip()
        if 입력 == "0":
            print("프로그램을 종료한다.")
            break

        print(f"입력된 파일 경로: ( {입력} )이 맞는가? (y/n)")
        확인 = input().strip().lower()
        if 확인 == "y":
            print("파일 경로가 확인되었다. 프로그램을 진행한다.")
            reader.mod02(입력)
        elif 확인 == "n":
            print("파일 경로를 다시 입력.")
            continue

# ==============================================================================
# 프로그램 실행
# ==============================================================================
if __name__ == "__main__":
    mod01()