# ==============================================================================
# mod02: 경로 불러오기
# ==============================================================================
import calc

def mod02(입력):
    print(f"입력한 경로 : {입력}")
    경로 = rf"{입력}"  # r로 읽어로면서 f로 입력형태로 경로 처리

    try:
        with open(경로, 'r', encoding='utf-8') as 파일: # 인코딩을 'utf-8'로 지정하여 텍스트 파일을 읽습니다.
            # 줄 단위로 읽어오기
            줄 = 파일.readlines()
            print("파일을 성공적으로 읽어왔습니다!")

    except Exception:
        print("EH-01: 파일 및 입력 오류 : 경로 및 파일 재확인")
        return None # 오류 발생 시 None을 반환하여 main에 알림

    return calc.mod03(줄)